Documents/НачислениеЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НачислениеЭлектроэнергии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСЭлектросетью</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределенияПерерасхода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаТарифа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийТариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаАдминистрирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееПотреблениеКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальноеПотреблениеКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерасходКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоБоксов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееПотреблениеУчетноеКвт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентыВводов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бокс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собственник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвтИндивидуально</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвтОДН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифПримененный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИндивидуально</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОДН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ввод</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СчетчикиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СчетчикиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СобственникиБоксов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СобственникиБоксов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ПотреблениеЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПотреблениеЭлектроэнергии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КвтЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСЭлектросетью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСЭлектросетью</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыРаспределенияПерерасхода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыРаспределенияПерерасхода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПересчетТарифа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоровнуНаБоксы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/НачислениеЭлектроэнергии/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Собственник заполняется расчётом автоматически
	Индекс = ПроверяемыеРеквизиты.Найти("Начисления.Собственник");
	Если Индекс <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Сообщить("Не указан период начисления."); Отказ = Истина;
	ИначеЕсли НачалоМесяца(Период) > НачалоМесяца(ТекущаяДатаСеанса()) Тогда
		Сообщить("Начисление за будущий месяц невозможно."); Отказ = Истина;
	КонецЕсли;
	Если СуммаАдминистрирования < 0 Тогда
		Сообщить("Сумма администрирования не может быть отрицательной.");	
	КонецЕсли;
	Если Начисления.Количество() = 0 Тогда
		Сообщить("Таблица начислений пуста — выполните расчёт."); Отказ = Истина;
	КонецЕсли;
	
	Для Каждого Стр Из Начисления Цикл
		Если Стр.Бокс.Пустая() Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": не указан бокс."); Отказ = Истина;
		КонецЕсли;
		Если Стр.Собственник.Пустая() Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": у бокса " + Строка(Стр.Бокс)
			+ " не найден собственник на конец периода.");
			Отказ = Истина;
		КонецЕсли;
		Если Стр.СуммаИтого < 0 Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": отрицательная сумма."); Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьИРассчитать() Экспорт
	НачПериода = НачалоМесяца(Период);
	КонПериода = КонецМесяца(Период);
	
	// ---------- 1. Цена тарифа ----------
	ЦенаТарифа = ЭлектроУчет.ТарифНаДату(Тариф, НачПериода);
	Если ЦенаТарифа = 0 Тогда
		ЦенаТарифа = ЭлектроУчет.ТарифНаДату(Тариф, КонПериода);
		Если ЦенаТарифа = 0 Тогда
			ВызватьИсключение "Не задана цена тарифа за период "
			+ Формат(НачПериода, "ДЛФ=D") + " — " + Формат(КонПериода, "ДЛФ=D")
			+ ". Создайте документ «Установка тарифа».";
		КонецЕсли;
		Сообщить("ВНИМАНИЕ: тариф установлен внутри месяца — весь месяц начислен по цене " + ЦенаТарифа + ".");
	КонецЕсли;
	ЭтотОбъект.ЦенаТарифа = ЦенаТарифа;
	
	// ---------- 2. Боксы + их ввод + индивидуальное потребление ----------
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеПоБоксам.Бокс КАК Бокс,
	|	ДанныеПоБоксам.Ввод КАК Ввод,
	|	ЕСТЬNULL(Потребление.КвтЧ, 0) КАК КвтЧ
	|ИЗ
	|	(ВЫБРАТЬ
	|		СчетчикиБоксовСрезПоследних.Бокс КАК Бокс,
	|		СчетчикиБоксовСрезПоследних.Бокс.Ввод КАК Ввод
	|	ИЗ
	|		РегистрСведений.СчетчикиБоксов.СрезПоследних(&КонецПериода, ) КАК СчетчикиБоксовСрезПоследних
	|
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		СобственникиБоксовСрезПоследних.Бокс,
	|		СобственникиБоксовСрезПоследних.Бокс.Ввод
	|	ИЗ
	|		РегистрСведений.СобственникиБоксов.СрезПоследних(&КонецПериода, ) КАК СобственникиБоксовСрезПоследних) КАК ДанныеПоБоксам
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПотреблениеЭлектроэнергииОбороты.Бокс КАК Бокс,
	|			СУММА(ПотреблениеЭлектроэнергииОбороты.КвтЧОборот) КАК КвтЧ
	|		ИЗ
	|			РегистрНакопления.ПотреблениеЭлектроэнергии.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ПотреблениеЭлектроэнергииОбороты
	|		ГДЕ
	|			ПотреблениеЭлектроэнергииОбороты.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.ТипыСчетчиков.ИндивидуальныйПриборУчета)
	|		СГРУППИРОВАТЬ ПО
	|			ПотреблениеЭлектроэнергииОбороты.Бокс) КАК Потребление
	|		ПО ДанныеПоБоксам.Бокс = Потребление.Бокс
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеПоБоксам.Бокс";
	Запрос.УстановитьПараметр("НачалоПериода", НачПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонПериода);
	
	Начисления.Очистить();
	БоксыБезВвода = ""; 
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ввод.Пустая() Тогда
			БоксыБезВвода = БоксыБезВвода + ?(БоксыБезВвода = "", "", ", ") + Строка(Выборка.Бокс);
		КонецЕсли;
		Стр = Начисления.Добавить();
		Стр.Бокс = Выборка.Бокс;
		Стр.Ввод = Выборка.Ввод;
		Стр.Собственник = ЭлектроУчет.СобственникБоксаНаДату(Выборка.Бокс, КонПериода);
		Стр.КвтИндивидуально = Выборка.КвтЧ;
	КонецЦикла;
	Если БоксыБезВвода <> "" Тогда
		ВызватьИсключение "Боксам не указан ввод (справочник «Гаражные боксы»): " + БоксыБезВвода + ".";
	КонецЕсли;
	
	// ---------- 3. Общий расход по вводам ----------
	Запрос2 = Новый Запрос;	
	Запрос2.Текст =
    "ВЫБРАТЬ
    |	ДанныеВвода.Ввод КАК Ввод,
    |	СУММА(ДанныеВвода.КвтЧ) КАК КвтЧ
    |ИЗ
    |	(ВЫБРАТЬ
    |		ВЫБОР
    |			КОГДА Обороты.Ввод = ЗНАЧЕНИЕ(Справочник.ВводыЭлектроснабжения.ПустаяСсылка)
    |				ТОГДА Обороты.Счетчик.Ввод
    |			ИНАЧЕ Обороты.Ввод
    |		КОНЕЦ КАК Ввод,
    |		Обороты.КвтЧОборот КАК КвтЧ
    |	ИЗ
    |		РегистрНакопления.ПотреблениеЭлектроэнергии.Обороты(&НачалоПериода, &КонецПериода, , ) КАК Обороты
    |	ГДЕ
    |		Обороты.ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.ТипыСчетчиков.ОбщийПриборУчета)) КАК ДанныеВвода
    |
    |СГРУППИРОВАТЬ ПО
    |	ДанныеВвода.Ввод";
	
	Запрос2.УстановитьПараметр("НачалоПериода", НачПериода);
	Запрос2.УстановитьПараметр("КонецПериода", КонПериода);
	
	ДанныеВводов = Новый Соответствие; // Ввод → Структура(ОбщееКвт, ИндивидуальноКвт, КонтрольнаяСумма)
	Выборка2 = Запрос2.Выполнить().Выбрать();
	Пока Выборка2.Следующий() Цикл
		Если Выборка2.Ввод.Пустая() Тогда
    ВызватьИсключение "Не удалось определить ввод для общих счётчиков с расходом за период."
    + Символы.ПС
    + "Возможные причины:"
    + Символы.ПС
    + "— движение потребления записано до обновления конфигурации и не содержит ввод;"
    + Символы.ПС
    + "— у одного из общих счётчиков не заполнен реквизит «Ввод»."
    + Символы.ПС
    + "Устраните причину или перепроведите документы за период, затем повторите расчёт.";
КонецЕсли;
		Данные = ДанныеВводов.Получить(Выборка2.Ввод);
		Если Данные = Неопределено Тогда
			Данные = Новый Структура("ОбщееКвт, ОбщееУчетноеКвт, ИндивидуальноКвт, КонтрольнаяСумма", 0, 0, 0, 0);
			ДанныеВводов.Вставить(Выборка2.Ввод, Данные);
		КонецЕсли;
		Данные.ОбщееКвт = Данные.ОбщееКвт + Выборка2.КвтЧ;
	КонецЦикла;
	
	// ---------- 4. Индивидуальное потребление по вводам ----------
	Для Каждого Стр Из Начисления Цикл
		Данные = ДанныеВводов.Получить(Стр.Ввод);
		Если Данные = Неопределено Тогда
			// боксы есть, а показаний общих счётчиков по этому вводу нет
			Данные = Новый Структура("ОбщееКвт, ОбщееУчетноеКвт, ИндивидуальноКвт, КонтрольнаяСумма", 0, 0, 0, 0);
			ДанныеВводов.Вставить(Стр.Ввод, Данные);
		КонецЕсли;
		Данные.ИндивидуальноКвт = Данные.ИндивидуальноКвт + Стр.КвтИндивидуально;
	КонецЦикла;
	
	// ---------- 5.0 Потери сети (коэффициенты из справочника вводов) -------
	// Формула Энергосбыта: потери = Окр(расход х (К-1), 3); учётное = расход + потери
	СтрокаКоэффициентов = "";
	Для каждого Элемент Из ДанныеВводов Цикл
		Данные = Элемент.Значение;
		Коэф = Элемент.Ключ.КоэффициентПотерь;
		Если Коэф <= 0 Тогда
			Сообщить("ВНИМАНИЕ: у ввода " + Строка(Элемент.Ключ) + " не задан коэффициент потерь - считается равным 1.");
			Коэф = 1;		
		КонецЕсли;
		Потери = Окр(Данные.ОбщееКвт * (Коэф - 1), 3, РежимОкругления.Окр15как20);
		Данные.ОбщееУчетноеКвт = Окр(Данные.ОбщееКвт + Потери, 3, РежимОкругления.Окр15как20);
		СтрокаКоэффициентов = СтрокаКоэффициентов + ?(СтрокаКоэффициентов = "", "","; ") + Строка(Элемент.Ключ) + ": " + Формат(Коэф, "ЧДЦ=4");	                                                     
	КонецЦикла; 
	ЭтотОбъект.КоэффициентыВводов = СтрокаКоэффициентов;
	
	// ---------- 5. Шапочные агрегаты ----------
	ОбщееФизич = 0;
	ОбщееУчетно = 0;
	ИндивидуальноВсего = 0;
	Для Каждого Элемент Из ДанныеВводов Цикл
		ОбщееФизич = ОбщееФизич + Элемент.Значение.ОбщееКвт;
		ОбщееУчетно = ОбщееУчетно + Элемент.Значение.ОбщееУчетноеКвт;
		ИндивидуальноВсего = ИндивидуальноВсего + Элемент.Значение.ИндивидуальноКвт;
	КонецЦикла;
	ЭтотОбъект.ОбщееПотреблениеКвт = ОбщееФизич;   //физически - сверка с Балансом кВт
	ЭтотОбъект.ОбщееПотреблениеУчетноеКвт = ОбщееУчетно; //с потерями - сверка с квитанцией
	ЭтотОбъект.ИндивидуальноеПотреблениеКвт = ИндивидуальноВсего;
	ЭтотОбъект.ПерерасходКвт = Окр(ОбщееУчетно - ИндивидуальноВсего, 3, РежимОкругления.Окр15как20);
	ЭтотОбъект.КоличествоБоксов = Начисления.Количество(); 
	
	//----------- 5.5. Администрирование: поровну на бокс -------------
	КолБоксовВсего = Начисления.Количество();
	АдминНаБокс = ?(КолБоксовВсего > 0, СуммаАдминистрирования / КолБоксовВсего, 0);
	
	// ---------- 6. Распределение — отдельно по каждому вводу ----------
	КонтрольнаяИтого = 0;
	Для Каждого Элемент Из ДанныеВводов Цикл
		Данные = Элемент.Значение;
		СтрокиВвода = Начисления.НайтиСтроки(Новый Структура("Ввод", Элемент.Ключ));
		Данные.Вставить("АдминДоля", Окр(АдминНаБокс * СтрокиВвода.Количество(), 2, РежимОкругления.Окр15как20));
		Если СтрокиВвода.Количество() = 0 И Данные.ОбщееКвт > 0 Тогда
			ВызватьИсключение "По вводу " + Строка(Элемент.Ключ) + " есть расход ("
			+ Данные.ОбщееКвт + " кВт), но к нему не привязан ни один бокс.";
		КонецЕсли;
		
		Если Данные.ОбщееКвт = 0 Тогда
			Сообщить("ВНИМАНИЕ: по вводу " + Строка(Элемент.Ключ)
			+ " нет показаний общих счётчиков за период — проверьте ввод показаний.");
		КонецЕсли;
		
		Если Данные.ИндивидуальноКвт > Данные.ОбщееКвт И Данные.ОбщееКвт > 0 Тогда
			Сообщить("ВНИМАНИЕ, ввод " + Строка(Элемент.Ключ) + ": индивидуальные показания ("
			+ Данные.ИндивидуальноКвт + ") превысили расход ввода (" + Данные.ОбщееКвт
			+ "). Проверьте показания!");
		КонецЕсли;
		
		Если СпособРаспределения = Перечисления.СпособыРаспределенияПерерасхода.ПересчетТарифа Тогда
			РаспределитьПересчетомТарифа(Данные, СтрокиВвода, ЦенаТарифа);
		Иначе
			РаспределитьПоровну(Данные, СтрокиВвода, ЦенаТарифа);
		КонецЕсли;
		КонтрольнаяИтого = КонтрольнаяИтого + Данные.КонтрольнаяСумма;
	КонецЦикла;
	
	ЭтотОбъект.КонтрольнаяСумма = Окр(КонтрольнаяИтого, 2, РежимОкругления.Окр15как20);
	// фактический тариф в шапке — средневзвешенный по кооперативу, для информации
	ЭтотОбъект.ФактическийТариф = ?(СпособРаспределения = Перечисления.СпособыРаспределенияПерерасхода.ПересчетТарифа 
	И ИндивидуальноВсего > 0, Окр((ОбщееУчетно * ЦенаТарифа + СуммаАдминистрирования) / ИндивидуальноВсего, 4, РежимОкругления.Окр15как20), ЦенаТарифа);
	
	ВыровнятьКопейки(); // не меняется: сверяет общую контрольную сумму и итог строк
КонецПроцедуры

// Способ А: деньги за расход ввода делятся пропорционально индивидуальному
// потреблению боксов этого же ввода (перерасход «зашит» в цену).
Процедура РаспределитьПересчетомТарифа(Данные, Строки, ЦенаТарифа)
	СуммаКСбору = Окр(Данные.ОбщееУчетноеКвт * ЦенаТарифа + Данные.АдминДоля, 2, РежимОкругления.Окр15как20);
	ФакТариф = ?(Данные.ИндивидуальноКвт > 0,
	Окр((СуммаКСбору / Данные.ИндивидуальноКвт), 4, РежимОкругления.Окр15как20), 0);
	Данные.КонтрольнаяСумма = СуммаКСбору;
	
	Для Каждого Стр Из Строки Цикл
		Стр.ТарифПримененный = ФакТариф;
		Стр.КвтОДН = 0;
		Стр.СуммаИндивидуально = Окр(Стр.КвтИндивидуально * ФакТариф, 2, РежимОкругления.Окр15как20);
		Стр.СуммаОДН = 0;
		Стр.СуммаИтого = Стр.СуммаИндивидуально;
	КонецЦикла;
	
	// пограничный случай: потребления нет вовсе — поровну
	Если Данные.ИндивидуальноКвт <= 0 И Данные.ОбщееУчетноеКвт > 0 И Строки.Количество() > 0 Тогда
		СуммаНаБокс = Окр(Данные.КонтрольнаяСумма / Строки.Количество(), 2, РежимОкругления.Окр15как20);
		Для Каждого Стр Из Строки Цикл
			Стр.СуммаИндивидуально = СуммаНаБокс;
			Стр.СуммаИтого = СуммаНаБокс;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// Способ Б: перерасход ввода (как ОДН) делится поровну на боксы этого же ввода.
Процедура РаспределитьПоровну(Данные, Строки, ЦенаТарифа)
	Перерасход = Макс(Данные.ОбщееУчетноеКвт - Данные.ИндивидуальноКвт, 0);
	Кол = Строки.Количество();
	СуммаОДННаБокс = ?(Кол > 0, (Перерасход * ЦенаТарифа + Данные.АдминДоля) / Кол, 0);
	Данные.КонтрольнаяСумма = Окр((Данные.ИндивидуальноКвт + Перерасход) * ЦенаТарифа + Данные.АдминДоля, 2, РежимОкругления.Окр15как20);
	
	Для Каждого Стр Из Строки Цикл
		Стр.ТарифПримененный = ЦенаТарифа;
		Стр.КвтОДН = ?(Кол > 0, Перерасход / Кол, 0);
		Стр.СуммаИндивидуально = Окр(Стр.КвтИндивидуально * ЦенаТарифа, 2, РежимОкругления.Окр15как20);
		Стр.СуммаОДН = Окр(СуммаОДННаБокс, 2, РежимОкругления.Окр15как20);
		Стр.СуммаИтого = Стр.СуммаИндивидуально + Стр.СуммаОДН;                   
	КонецЦикла;
КонецПроцедуры

Процедура ВыровнятьКопейки()
	Разница = Окр(КонтрольнаяСумма - Начисления.Итог("СуммаИтого"), 2, РежимОкругления.Окр15как20);
	ЭтотОбъект.СуммаНачислено = Окр(Начисления.Итог("СуммаИтого") + Разница, 2, РежимОкругления.Окр15как20);
	
	Если Разница = 0 ИЛИ Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// participating: строки с индивидуальным потреблением
	Участвующие = Новый Массив;
	Для Каждого Стр Из Начисления Цикл
		Если Стр.КвтИндивидуально > 0 Тогда
			Участвующие.Добавить(Стр);
		КонецЕсли;
	КонецЦикла;
	
	Если Участвующие.Количество() = 0 Тогда
		Возврат; // потребления нет ни у кого — раздавать некому (бывает при способе Б)
	КонецЕсли;
	
	КопеекКРаздаче = ?(Разница > 0, Цел(Разница * 100), Цел(-Разница * 100));
	
	// стартовая строка сдвигается по месяцам
	Ном = (Месяц(Период) - 1) % Участвующие.Количество();
	
	Пока КопеекКРаздаче > 0 Цикл
		Стр = Участвующие[Ном];
		Если Разница > 0 Тогда
			Стр.СуммаИтого = Стр.СуммаИтого + 0.01;
			Стр.СуммаИндивидуально = Стр.СуммаИндивидуально + 0.01; // копейка — к потреблению, не к ОДН
		Иначе
			Стр.СуммаИтого = Стр.СуммаИтого - 0.01;
			Стр.СуммаИндивидуально = Стр.СуммаИндивидуально - 0.01;
		КонецЕсли;
		КопеекКРаздаче = КопеекКРаздаче - 1;
		Ном = Ном + 1;
		Если Ном >= Участвующие.Количество() Тогда
			Ном = 0;
		КонецЕсли;
	КонецЦикла;
	
	// перезаписать итог уже с раздачей
	ЭтотОбъект.СуммаНачислено = Начисления.Итог("СуммаИтого");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Колво
	|ИЗ
	|	Документ.НачислениеЭлектроэнергии КАК Д
	|ГДЕ
	|	Д.Проведен
	|	И Д.Ссылка <> &Ссылка
	|	И НАЧАЛОПЕРИОДА(Д.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Если Запрос.Выполнить().Выгрузить()[0].Колво > 0 Тогда
		Сообщить("За этот месяц уже есть проведённое начисление.");
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	Если Окр(СуммаНачислено - КонтрольнаяСумма, 2, РежимОкругления.Окр15как20) <> 0 Тогда
		Сообщить("Сумма начислений (" + СуммаНачислено + ") не сходится с контрольной ("
		+ КонтрольнаяСумма + "). Выполните расчёт заново.");
		Отказ = Истина; 
		Возврат;
	КонецЕсли;
	
	// ---------- Долг владельцев ----------
	Движения.Взаиморасчеты.Записывать = Истина;
	СуммыПоВводам = Новый Соответствие;
	Для Каждого Стр Из Начисления Цикл
		Если Стр.СуммаИтого = 0 Тогда 
			Продолжить; 
		КонецЕсли;
		Если Стр.Ввод.Пустая() Тогда
			Сообщить("Строка " + Стр.НомерСтроки + ": не указан ввод — долг перед сетью"
			+ " по ней не будет учтён.");
			Отказ = Истина; 
			Продолжить;
		КонецЕсли;
		Движение = Движения.Взаиморасчеты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Бокс = Стр.Бокс;
		Движение.Собственник = Стр.Собственник;
		Движение.Сумма = Стр.СуммаИтого;
		
		Сумма = СуммыПоВводам.Получить(Стр.Ввод);
		СуммыПоВводам.Вставить(Стр.Ввод, ?(Сумма = Неопределено, 0, Сумма) + Стр.СуммаИтого);
	КонецЦикла;
	Если Отказ Тогда
		Возврат; 
	КонецЕсли;
	
	// ---------- Долг перед электросетью (по вводам, без администрирования) ----------
	Движения.РасчетыСЭлектросетью.Записывать = Истина;
	КолБоксовВсего = Начисления.Количество();
	Для Каждого Элемент Из СуммыПоВводам Цикл
		Если Элемент.Значение = 0 Тогда 
			Продолжить; 
		КонецЕсли;
		КолБоксовВвода = Начисления.НайтиСтроки(Новый Структура("Ввод", Элемент.Ключ)).Количество();
		АдминДоля = ? (КолБоксовВсего > 0, Окр(СуммаАдминистрирования * КолБоксовВвода / КолБоксовВсего, 2, РежимОкругления.Окр15как20), 0);
		СуммаСети = Окр(Элемент.Значение - АдминДоля, 2, РежимОкругления.Окр15как20);
		Если СуммаСети <= 0 Тогда
			ПРодолжить;		
		КонецЕсли;
		Движение = Движения.РасчетыСЭлектросетью.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход; // должны сети
		Движение.Период = Дата;
		Движение.Ввод = Элемент.Ключ;
		Движение.Сумма = СуммаСети;
	КонецЦикла;
КонецПроцедуры
